BarbaraNeanake/BLEBeaconSmartParking-C06/firmware/STM32f401ccu6/src/main.c
#include "stm32f4xx_hal.h"
#include <string.h>
#include <stdio.h>

// LED pin configuration
#define LED_PIN GPIO_PIN_13
#define LED_PORT GPIOC

// ESP32-CAM Trigger Pin (SPI CS - PB12)
#define TRIGGER_PIN GPIO_PIN_12
#define TRIGGER_PORT GPIOB

// ESP-01 Configuration
#define ESP01_USART USART1
#define ESP01_BAUDRATE 115200

// WiFi Credentials
#define WIFI_SSID "Waifai"
#define WIFI_PASSWORD "123654987"

// HiveMQ Public Broker
#define MQTT_BROKER "broker.hivemq.com"
#define MQTT_PORT 1883
#define MQTT_CLIENT_ID "SPARK_C06"

// MQTT Topic Configuration - Smart Parking System
#define MQTT_TOPIC_BASE "SPARK_C06/isOccupied/"
#define MQTT_TOPIC_SUB MQTT_TOPIC_BASE "#"              // Subscribe: "SPARK_C06/isOccupied/*" (all slots)
#define MQTT_TOPIC_PUB "SPARK_C06/camera/status"        // Publish: camera status
#define MQTT_KEYWORD_OCCUPIED "True"                        // Payload: car detected
#define MQTT_KEYWORD_EMPTY "False"                           // Payload: spot empty

// Smart Parking Debouncing State Machine Configuration
#define TRIGGER_PULSE_MS 100     // Trigger pulse duration (100ms HIGH)
#define STABILIZING_MS 2000      // Wait 2s for car to stabilize (reduced for multi-slot)
#define COOLDOWN_MS 5000         // Cooldown period (5 seconds) - exits early if spot clears

// State Machine States for Smart Parking
typedef enum {
    STATE_IDLE = 0,      // Spot empty, waiting for car detection
    STATE_STABILIZING,   // Car detected, waiting for stable state (driver aligning)
    STATE_CONFIRMED,     // Car stable, trigger camera (100ms pulse)
    STATE_COOLDOWN       // Post-capture cooldown (30s)
} TriggerState_t;

// Buffer sizes
#define RX_BUFFER_SIZE 512
#define TX_BUFFER_SIZE 256

void SystemClock_Config(void);
void Error_Handler(void);
static void GPIO_Init(void);
static void USART1_Init(void);
static void Blink_Status(uint8_t count, uint16_t delay);

// ESP-01 Functions (Raw MQTT over TCP)
static void send_AT(const char* cmd, uint32_t delay_ms);
static void send_data(uint8_t* data, uint16_t len);
static void wait_for_prompt(void);
static uint8_t ESP01_ConnectWiFi(const char* ssid, const char* password);
static uint8_t ESP01_ConnectMQTTBroker(const char* broker, uint16_t port);
static uint8_t ESP01_Send_MQTT_CONNECT(const char* clientID);
static void ESP01_Send_MQTT_PUBLISH(const char* topic, const char* message);
static void ESP01_Send_MQTT_SUBSCRIBE(const char* topic);
static void ESP01_ReceiveAndParse(void);
static uint8_t ESP01_CheckConnection(void);
static void ESP01_Reconnect(void);
static void ESP01_SendPing(void);

// Global variables
UART_HandleTypeDef huart1;
char rx_buffer[RX_BUFFER_SIZE];
volatile uint16_t rx_index = 0;
volatile uint8_t rx_byte;
volatile uint8_t message_received = 0;
volatile uint8_t wifi_connected = 0;
volatile uint8_t mqtt_connected = 0;
uint32_t last_ping_time = 0;
uint32_t ping_interval = 30000; // Ping every 30 seconds
uint32_t last_publish_time = 0;
uint32_t publish_interval = 60000; // Publish status every 60 seconds

// State Machine Variables
volatile TriggerState_t trigger_state = STATE_IDLE;
volatile uint32_t state_timer = 0;

int main(void)
{
    // Initialize HAL
    HAL_Init();
    
    // Configure system clock
    SystemClock_Config();
    
    // Initialize GPIO for LED
    GPIO_Init();
    
    // Initialize USART1 for ESP-01
    USART1_Init();
    
    // System ready - initial blink pattern
    Blink_Status(3, 200);
    
    // Wait for ESP-01 to fully boot
    HAL_Delay(2000);
    
    // Clear RX buffer
    rx_index = 0;
    memset(rx_buffer, 0, RX_BUFFER_SIZE);
    
    // Disable echo for cleaner responses
    send_AT("ATE0\r\n", 500);
    HAL_Delay(500);
    
    // Connect to WiFi
    if (ESP01_ConnectWiFi(WIFI_SSID, WIFI_PASSWORD))
    {
        Blink_Status(3, 300); // WiFi connected
        HAL_Delay(1000);
    }
    else
    {
        Blink_Status(10, 200); // WiFi failed (10 medium blinks)
        while(1) { HAL_Delay(1000); } // Halt here for debugging
    }
    
    // Connect to MQTT Broker via TCP
    if (ESP01_ConnectMQTTBroker(MQTT_BROKER, MQTT_PORT))
    {
        HAL_Delay(2000);
    }
    else
    {
        Blink_Status(10, 300); // MQTT TCP failed (10 slow blinks)
        while(1) { HAL_Delay(1000); } // Halt here for debugging
    }
    
    // Send MQTT CONNECT packet
    if (ESP01_Send_MQTT_CONNECT(MQTT_CLIENT_ID))
    {
        Blink_Status(5, 200); // MQTT connected
        HAL_Delay(2000);
    }
    else
    {
        Blink_Status(10, 400); // MQTT CONNECT failed (10 very slow blinks)
        while(1) { HAL_Delay(1000); } // Halt here for debugging
    }
    
    // Subscribe to command topic
    ESP01_Send_MQTT_SUBSCRIBE(MQTT_TOPIC_SUB);
    Blink_Status(4, 150); // Subscribed
    HAL_Delay(2000);  // Wait longer after subscribe
    
    // Main loop - MQTT message processing
    uint32_t lastCheckTime = HAL_GetTick();
    last_ping_time = HAL_GetTick();
    last_publish_time = HAL_GetTick();
    
    // Delay first connection check to allow connection to stabilize
    lastCheckTime = HAL_GetTick() - 240000;  // First check at 5 minutes
    
    while (1)
    {
        // Check for incoming MQTT messages (triggers state machine)
        ESP01_ReceiveAndParse();
        
        // Smart Parking State Machine - handles multiple sensor fluctuations
        switch (trigger_state)
        {
            case STATE_STABILIZING:
                // Check if 2s stabilization period elapsed
                if ((HAL_GetTick() - state_timer) >= STABILIZING_MS)
                {
                    // Car is stable - trigger camera
                    // Note: Wide-angle camera captures ALL slots in view
                    HAL_GPIO_WritePin(TRIGGER_PORT, TRIGGER_PIN, GPIO_PIN_SET);
                    
                    // Visual feedback: capturing image
                    Blink_Status(3, 100);
                    
                    // Transition to CONFIRMED state
                    state_timer = HAL_GetTick();
                    trigger_state = STATE_CONFIRMED;
                }
                // Note: Timer is reset by ESP01_ReceiveAndParse() if new "occupied" received
                // This means last car to arrive within 2s window triggers capture
                break;
                
            case STATE_CONFIRMED:
                // Check if 100ms camera trigger pulse elapsed
                if ((HAL_GetTick() - state_timer) >= TRIGGER_PULSE_MS)
                {
                    // End trigger pulse
                    HAL_GPIO_WritePin(TRIGGER_PORT, TRIGGER_PIN, GPIO_PIN_RESET);
                    
                    // Visual feedback: capture complete
                    Blink_Status(1, 50);
                    
                    // Transition to cooldown (5s minimum, exits early if spot clears)
                    state_timer = HAL_GetTick();
                    trigger_state = STATE_COOLDOWN;
                }
                break;
                
            case STATE_COOLDOWN:
                // Check if 5-second minimum cooldown elapsed
                if ((HAL_GetTick() - state_timer) >= COOLDOWN_MS)
                {
                    // Return to idle state - ready for next parking event
                    trigger_state = STATE_IDLE;
                    
                    // Visual feedback: system ready
                    Blink_Status(2, 200);
                }
                // Note: Cooldown exits early if "empty" detected (handled in ESP01_ReceiveAndParse)
                // This allows next car to trigger without waiting full 5 seconds
                break;
                
            case STATE_IDLE:
            default:
                // Spot empty, waiting for car detection via MQTT
                break;
        }
        
        // Publish status message every 60 seconds
        if ((HAL_GetTick() - last_publish_time) >= publish_interval)
        {
            char status_msg[64];
            uint32_t uptime_seconds = HAL_GetTick() / 1000;
            snprintf(status_msg, sizeof(status_msg), "Alive: %lu sec", uptime_seconds);
            ESP01_Send_MQTT_PUBLISH(MQTT_TOPIC_PUB, status_msg);
            last_publish_time = HAL_GetTick();
        }
        
        // Send MQTT ping every 30 seconds to keep connection alive
        if ((HAL_GetTick() - last_ping_time) >= ping_interval)
        {
            ESP01_SendPing();
            last_ping_time = HAL_GetTick();
        }
        
        // Check connection status every 5 minutes (was causing false disconnects)
        if ((HAL_GetTick() - lastCheckTime) >= 300000)
        {
            if (!ESP01_CheckConnection())
            {
                // Connection lost - attempt reconnect
                ESP01_Reconnect();
            }
            lastCheckTime = HAL_GetTick();
        }
        
