BarbaraNeanake/BLEBeaconSmartParking-C06/firmware/STM32f401ccu6/src/main.c
        HAL_Delay(100); // Small delay to allow message processing
    }
    
    return 0;
}

/**
  * @brief System Clock Configuration
  * Configures the system clock to use HSI at 16 MHz
  */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    // Configure the main internal regulator output voltage
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    // Initialize HSI and configure PLL to 84MHz
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM = 16;  // HSI = 16MHz
    RCC_OscInitStruct.PLL.PLLN = 336; // VCO = 336MHz
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;  // SYSCLK = 84MHz
    RCC_OscInitStruct.PLL.PLLQ = 7;
    
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    // Configure CPU, AHB and APB buses clocks
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;  // Use PLL as system clock
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;         // AHB = 84MHz
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;          // APB1 = 42MHz (max 42MHz)
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;          // APB2 = 84MHz

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)  // 2 wait states for 84MHz
    {
        Error_Handler();
    }
}

/**
  * @brief GPIO Initialization
  * Configures GPIO pin PC13 as output for LED and PB12 as ESP32-CAM CS
  */
static void GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // Enable GPIO Port C, B, and A clocks
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    // Configure GPIO pin PC13 (LED)
    GPIO_InitStruct.Pin = LED_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct);

    // Configure GPIO pin PB12 (Trigger Pin for ESP32-CAM)
    GPIO_InitStruct.Pin = TRIGGER_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(TRIGGER_PORT, &GPIO_InitStruct);

    // Initialize LED OFF, Trigger Pin LOW
    HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(TRIGGER_PORT, TRIGGER_PIN, GPIO_PIN_RESET);
}

/**
  * @brief USART1 Initialization for ESP-01
  * PB6 - USART1_TX, PB7 - USART1_RX
  */
static void USART1_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    
    // Enable clocks
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_USART1_CLK_ENABLE();
    
    // Configure GPIO pins for USART1
    // PB6: TX, PB7: RX
    GPIO_InitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    
    // Configure USART1
    huart1.Instance = USART1;
    huart1.Init.BaudRate = ESP01_BAUDRATE;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    
    if (HAL_UART_Init(&huart1) != HAL_OK)
    {
        Error_Handler();
    }
    
    // Enable UART receive interrupt
    HAL_NVIC_SetPriority(USART1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(USART1_IRQn);
    
    // Start receiving in interrupt mode
    HAL_UART_Receive_IT(&huart1, (uint8_t*)&rx_byte, 1);
}

/**
  * @brief Send AT command and wait
  */
static void send_AT(const char* cmd, uint32_t delay_ms)
{
    // Temporarily abort RX interrupt to avoid conflicts
    HAL_UART_AbortReceive_IT(&huart1);
    
    HAL_UART_Transmit(&huart1, (uint8_t*)cmd, strlen(cmd), HAL_MAX_DELAY);
    HAL_Delay(delay_ms);
    
    // Restart RX interrupt
    HAL_UART_Receive_IT(&huart1, (uint8_t*)&rx_byte, 1);
}

/**
  * @brief Send raw data to ESP-01
  */
static void send_data(uint8_t* data, uint16_t len)
{
    // Temporarily abort RX interrupt to avoid conflicts
    HAL_UART_AbortReceive_IT(&huart1);
    
    HAL_UART_Transmit(&huart1, data, len, HAL_MAX_DELAY);
    HAL_Delay(500);
    
    // Restart RX interrupt
    HAL_UART_Receive_IT(&huart1, (uint8_t*)&rx_byte, 1);
}

/**
  * @brief Wait for '>' prompt from ESP-01 after AT+CIPSEND
  */
static void wait_for_prompt(void)
{
    // Just wait for prompt - no blocking read
    HAL_Delay(500);
}

/**
  * @brief Connect ESP-01 to WiFi network
  * @return 1 if connected, 0 if failed
  */
static uint8_t ESP01_ConnectWiFi(const char* ssid, const char* password)
{
    // Clear RX buffer
    rx_index = 0;
    memset(rx_buffer, 0, RX_BUFFER_SIZE);
    
    // Set station mode (STA)
    send_AT("AT+CWMODE=1\r\n", 1000);
    
    // Disconnect from any existing WiFi first
    send_AT("AT+CWQAP\r\n", 1000);
    HAL_Delay(1000);
    
    // Clear buffers
    rx_index = 0;
    memset(rx_buffer, 0, RX_BUFFER_SIZE);
    
    // Connect to WiFi - just send the command and wait
    char wifiCommand[128];
    snprintf(wifiCommand, sizeof(wifiCommand),
             "AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password);
    
    HAL_UART_Transmit(&huart1, (uint8_t*)wifiCommand, strlen(wifiCommand), HAL_MAX_DELAY);
    
    // Blink during connection attempt - WiFi can take 5-10 seconds
    for (uint8_t i = 0; i < 40; i++)  // 40 x 250ms = 10 seconds
    {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(250);
    }
    HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_RESET);
    
    // Trust that WiFi connected (no blocking read)
    HAL_Delay(2000);
    
    wifi_connected = 1;
    return 1;
}

/**
  * @brief Connect to MQTT broker via TCP
  * @return 1 if connected, 0 if failed
  */
static uint8_t ESP01_ConnectMQTTBroker(const char* broker, uint16_t port)
{
    char cmd[128];
    
    // Clear any existing connection first
    send_AT("AT+CIPCLOSE\r\n", 1000);
    
    // Clear RX buffer
    rx_index = 0;
    memset(rx_buffer, 0, RX_BUFFER_SIZE);
    
    snprintf(cmd, sizeof(cmd),
             "AT+CIPSTART=\"TCP\",\"%s\",%d\r\n", broker, port);
    
    HAL_UART_Transmit(&huart1, (uint8_t*)cmd, strlen(cmd), HAL_MAX_DELAY);
    
    // Wait for TCP connection - no blocking read
    HAL_Delay(6000);
    
    // Trust connection succeeded
    return 1;
}

/**
  * @brief Send MQTT CONNECT packet
  * @return 1 if successful, 0 if failed
  */
static uint8_t ESP01_Send_MQTT_CONNECT(const char* clientID)
{
    uint8_t packet[128];
    uint8_t clientID_len = strlen(clientID);
    uint8_t total_len = 10 + 2 + clientID_len;
    
