BarbaraNeanake/BLEBeaconSmartParking-C06/firmware/STM32f401ccu6/src/main.c
    uint8_t index = 0;
    packet[index++] = 0x10;                     // CONNECT command
    packet[index++] = total_len;                // Remaining length
    packet[index++] = 0x00; packet[index++] = 0x04; // Length of "MQTT"
    packet[index++] = 'M'; packet[index++] = 'Q'; 
    packet[index++] = 'T'; packet[index++] = 'T';
    packet[index++] = 0x04;                     // Protocol level 4
    packet[index++] = 0x02;                     // Clean session
    packet[index++] = 0x00; packet[index++] = 0x3C; // Keep alive = 60 sec
    packet[index++] = 0x00; packet[index++] = clientID_len;
    memcpy(&packet[index], clientID, clientID_len);
    index += clientID_len;
    
    // Clear RX buffer
    rx_index = 0;
    memset(rx_buffer, 0, RX_BUFFER_SIZE);
    
    // Send CIPSEND command
    char sendCmd[32];
    snprintf(sendCmd, sizeof(sendCmd), "AT+CIPSEND=%d\r\n", index);
    HAL_UART_Transmit(&huart1, (uint8_t*)sendCmd, strlen(sendCmd), HAL_MAX_DELAY);
    
    // Wait for '>' prompt
    wait_for_prompt();
    
    // Send MQTT CONNECT packet
    HAL_UART_Transmit(&huart1, packet, index, HAL_MAX_DELAY);
    
    // Wait for MQTT CONNACK - no blocking read
    HAL_Delay(2000);
    
    // Trust MQTT CONNECT succeeded
    mqtt_connected = 1;
    return 1;
}

/**
  * @brief Send MQTT PUBLISH packet
  */
static void ESP01_Send_MQTT_PUBLISH(const char* topic, const char* message)
{
    uint8_t packet[256];
    uint8_t topic_len = strlen(topic);
    uint8_t message_len = strlen(message);
    
    uint8_t remaining_len = 2 + topic_len + message_len;
    uint8_t index = 0;
    
    packet[index++] = 0x30;                     // PUBLISH command (QoS 0)
    packet[index++] = remaining_len;            // Remaining length
    packet[index++] = 0x00;                     // Topic length MSB
    packet[index++] = topic_len;                // Topic length LSB
    memcpy(&packet[index], topic, topic_len);
    index += topic_len;
    memcpy(&packet[index], message, message_len);
    index += message_len;
    
    // Send CIPSEND command
    char sendCmd[32];
    snprintf(sendCmd, sizeof(sendCmd), "AT+CIPSEND=%d\r\n", index);
    HAL_UART_Transmit(&huart1, (uint8_t*)sendCmd, strlen(sendCmd), HAL_MAX_DELAY);
    
    // Wait for '>' prompt
    wait_for_prompt();
    
    // Send MQTT PUBLISH packet
    send_data(packet, index);
}

/**
  * @brief Send MQTT SUBSCRIBE packet
  */
static void ESP01_Send_MQTT_SUBSCRIBE(const char* topic)
{
    uint8_t packet[128];
    uint8_t topic_len = strlen(topic);
    uint8_t remaining_len = 2 + 2 + topic_len + 1; // Packet ID (2) + Topic length (2) + Topic + QoS (1)
    
    uint8_t index = 0;
    packet[index++] = 0x82;            // SUBSCRIBE packet type with flags
    packet[index++] = remaining_len;   // Remaining Length
    packet[index++] = 0x00;            // Packet ID MSB
    packet[index++] = 0x01;            // Packet ID LSB
    packet[index++] = 0x00;            // Topic length MSB
    packet[index++] = topic_len;       // Topic length LSB
    memcpy(&packet[index], topic, topic_len); // Topic
    index += topic_len;
    packet[index++] = 0x00;            // QoS 0
    
    // Send CIPSEND command
    char sendCmd[32];
    snprintf(sendCmd, sizeof(sendCmd), "AT+CIPSEND=%d\r\n", index);
    HAL_UART_Transmit(&huart1, (uint8_t*)sendCmd, strlen(sendCmd), HAL_MAX_DELAY);
    
    // Wait for '>' prompt
    wait_for_prompt();
    
    // Send MQTT SUBSCRIBE packet
    send_data(packet, index);
}

/**
  * @brief Receive and parse incoming MQTT messages
  * Sets capture_triggered flag when MQTT PUBLISH received
  */
static void ESP01_ReceiveAndParse(void)
{
    // Wait for enough bytes (MQTT PUBLISH packet is ~37 bytes from ESP-01)
    if (rx_index < 30)
        return;
    
    // Search for occupancy keywords in the raw buffer
    // Don't rely on null termination - search byte by byte using strncmp
    
    // Check for "occupied" keyword
    const char* keyword_occupied = MQTT_KEYWORD_OCCUPIED;
    const int occupied_len = strlen(keyword_occupied);
    int found_occupied = 0;
    
    for (int i = 0; i <= rx_index - occupied_len; i++)
    {
        if (strncmp((char*)&rx_buffer[i], keyword_occupied, occupied_len) == 0)
        {
            found_occupied = 1;
            break;
        }
    }
    
    // Check for "empty" keyword
    const char* keyword_empty = MQTT_KEYWORD_EMPTY;
    const int empty_len = strlen(keyword_empty);
    int found_empty = 0;
    
    for (int i = 0; i <= rx_index - empty_len; i++)
    {
        if (strncmp((char*)&rx_buffer[i], keyword_empty, empty_len) == 0)
        {
            found_empty = 1;
            break;
        }
    }
    
    if (found_occupied)
    {
        // Smart Parking Logic: Handle "occupied" (car detected)
        
        if (trigger_state == STATE_IDLE)
        {
            // First detection - car approaching spot
            // Enter STABILIZING state (wait for driver to finish aligning)
            
            // Visual feedback: car detected
            Blink_Status(2, 100);
            
            // Start stabilization timer (3 seconds)
            state_timer = HAL_GetTick();
            trigger_state = STATE_STABILIZING;
        }
        else if (trigger_state == STATE_STABILIZING)
        {
            // Additional "occupied" message while stabilizing
            // This means car is still moving (driver aligning)
            // Reset timer to wait for stable state
            
            state_timer = HAL_GetTick();  // Reset 3s timer
            
            // Visual feedback: still aligning
            HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        }
        // Else: In CONFIRMED or COOLDOWN - ignore additional messages
        
        // Clear buffer after processing
        rx_index = 0;
        memset(rx_buffer, 0, RX_BUFFER_SIZE);
    }
    else if (found_empty)
    {
        // Smart Parking Logic: Handle "empty" (spot cleared)
        
        if (trigger_state == STATE_STABILIZING)
        {
            // Car left before parking was confirmed
            // Driver decided not to park, or reversed out
            // Return to IDLE immediately
            
            trigger_state = STATE_IDLE;
            
            // Visual feedback: car left
            Blink_Status(1, 300);
        }
        else if (trigger_state == STATE_COOLDOWN)
        {
            // Car left after parking - exit cooldown early
            // This allows next car to trigger camera without waiting full 5s
            // Safe assumption: passengers never trigger sensor
            
            trigger_state = STATE_IDLE;
            
