BarbaraNeanake/BLEBeaconSmartParking-C06/firmware/STM32f401ccu6/src/main.c
            // Visual feedback: spot cleared, ready for next car
            Blink_Status(2, 200);
        }
        // If in IDLE or CONFIRMED state, ignore (shouldn't happen)
        
        // Clear buffer after processing
        rx_index = 0;
        memset(rx_buffer, 0, RX_BUFFER_SIZE);
    }
    else
    {
        // No match found, clear buffer if getting too full
        if (rx_index > RX_BUFFER_SIZE - 100)
        {
            rx_index = 0;
            memset(rx_buffer, 0, RX_BUFFER_SIZE);
        }
    }
}

/**
  * @brief Blink LED for status indication
  */
static void Blink_Status(uint8_t count, uint16_t delay)
{
    for (uint8_t i = 0; i < count; i++)
    {
        HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET);
        HAL_Delay(delay);
        HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_RESET);
        HAL_Delay(delay);
    }
}

/**
  * @brief Send MQTT PINGREQ to keep connection alive
  */
static void ESP01_SendPing(void)
{
    uint8_t ping_packet[2] = {0xC0, 0x00}; // PINGREQ packet
    
    char sendCmd[32];
    snprintf(sendCmd, sizeof(sendCmd), "AT+CIPSEND=%d\r\n", 2);
    HAL_UART_Transmit(&huart1, (uint8_t*)sendCmd, strlen(sendCmd), HAL_MAX_DELAY);
    
    wait_for_prompt();
    send_data(ping_packet, 2);
}

/**
  * @brief Check if connection is still alive
  * @return 1 if connected, 0 if disconnected
  */
static uint8_t ESP01_CheckConnection(void)
{
    // Trust that connection is alive
    // The ESP-01 will indicate if connection drops via +IPD or error messages
    // which will be caught by the interrupt handler
    return 1;
}

/**
  * @brief Reconnect to WiFi and MQTT broker
  */
static void ESP01_Reconnect(void)
{
    // Indicate reconnection attempt
    Blink_Status(10, 50); // Rapid blinks
    
    // Mark as disconnected
    wifi_connected = 0;
    mqtt_connected = 0;
    
    // Close existing connection
    send_AT("AT+CIPCLOSE\r\n", 1000);
    HAL_Delay(1000);
    
    // Try to reconnect to WiFi
    if (ESP01_ConnectWiFi(WIFI_SSID, WIFI_PASSWORD))
    {
        Blink_Status(3, 300); // WiFi reconnected
        HAL_Delay(1000);
        
        // Try to reconnect to MQTT broker
        if (ESP01_ConnectMQTTBroker(MQTT_BROKER, MQTT_PORT))
        {
            HAL_Delay(2000);
            
            // Send MQTT CONNECT
            if (ESP01_Send_MQTT_CONNECT(MQTT_CLIENT_ID))
            {
                Blink_Status(5, 200); // MQTT reconnected
                HAL_Delay(2000);
                
                // Re-subscribe to topic
                ESP01_Send_MQTT_SUBSCRIBE(MQTT_TOPIC_SUB);
                Blink_Status(4, 150); // Resubscribed
                HAL_Delay(1000);
            }
        }
    }
    else
    {
        // Reconnection failed
        Blink_Status(15, 100); // Long error blink
        HAL_Delay(5000); // Wait before next attempt
    }
}

/**
  * @brief UART receive complete callback
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART1)
    {
        // Add received byte to buffer
        if (rx_index < RX_BUFFER_SIZE - 1)
        {
            rx_buffer[rx_index++] = rx_byte;
        }
        else
        {
            // Buffer full, reset
            rx_index = 0;
        }
        
        // Continue receiving
        HAL_UART_Receive_IT(&huart1, (uint8_t*)&rx_byte, 1);
    }
}

/**
  * @brief USART1 IRQ Handler
  */
void USART1_IRQHandler(void)
{
    HAL_UART_IRQHandler(&huart1);
}

/**
  * @brief Error Handler
  * This function is executed in case of error occurrence.
  */
void Error_Handler(void)
{
    // Disable all interrupts
    __disable_irq();
    
    // Infinite loop
    while (1)
    {
    }
}

/**
  * @brief This function is executed in case of a fault occurrence.
  */
void HardFault_Handler(void)
{
    Error_Handler();
}

/**
  * @brief This function handles Memory management fault.
  */
void MemManage_Handler(void)
{
    Error_Handler();
}

/**
  * @brief This function handles Prefetch fault, memory access fault.
  */
void BusFault_Handler(void)
{
    Error_Handler();
}

/**
  * @brief This function handles Undefined instruction or illegal state.
  */
void UsageFault_Handler(void)
{
    Error_Handler();
}

/**
  * @brief This function handles System service call via SWI instruction.
  */
void SVC_Handler(void)
{
}

/**
  * @brief This function handles Debug monitor.
  */
void DebugMon_Handler(void)
{
}

/**
  * @brief This function handles PendSV, except handler.
  */
void PendSV_Handler(void)
{
}

/**
  * @brief This function handles SysTick Handler.
  */
void SysTick_Handler(void)
{
    HAL_IncTick();
}
